Fixed LaTex issues
